# Data Wrangling in Python

# Importing Libraries

In [1]:
import pandas as pd;
import numpy as np;
import seaborn as sns;

In [2]:
kashti = sns.load_dataset('titanic')
ks1 = sns.load_dataset('titanic')
ks2 = sns.load_dataset('titanic')

In [3]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# Perform simple Math Operator in any Column

In [4]:
(kashti['age'] + 1).head(10)

0    23.0
1    39.0
2    27.0
3    36.0
4    36.0
5     NaN
6    55.0
7     3.0
8    28.0
9    15.0
Name: age, dtype: float64

# Data Wrangling Steps
1- Remove Missing values

# Finding Missing values in columns

In [5]:
kashti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

# Use Drop.na() method to remove null values

In [6]:
# to know the rows and columns in panda data set
#print(kashti.shape)
# to drop rows contains nan
kashti.dropna(subset=['deck'],axis=0,inplace=True)
print(kashti.shape)

(203, 15)

In [7]:
kashti.dropna(inplace=True)
kashti.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [8]:
kashti.shape

(182, 15)

# Now Using Data Replacment technique For Wrangling

In [9]:
ks1['age'].mean()
#ks1.shape

29.69911764705882

# Now Replace Nan with its mean in age column

In [10]:
ks1['age'] = ks1['age'].replace(np.nan, ks1['age'].mean())

In [11]:
ks1.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [12]:
# Replacing deck column with its mode because it is a non numerical column
#ks1['deck'] = ks1['deck'].replace(, ks1['deck'].mode())
#print(ks1['deck'].mode())
ks1['deck'].fillna(ks1['deck'].mode()[0], inplace=True)

In [13]:
#ks1.isnull().sum()
ks1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True

In [14]:
ks1['embarked'].fillna(ks1['embarked'].mode()[0], inplace=True)

In [15]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [16]:
ks1['embark_town'].fillna(ks1['embark_town'].mode()[0], inplace=True)

In [17]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64